"""
Ново хайку, защото Виктор е сърдит:

...- .-.. --.- --.. --- .... / ...- / --.. .- .-.. .- /
-. .- / .--. .-. --- .--- . -.- - --- .-. / ... .--. .- -- / ... .--. .- -- / ... .--. .- -- /
- .-. ..- --. -. .- .... / ... .. / --- - - .- --

**[Title/Звание]**
Shredded Monty Python

**[Description/Обрисовка]**
Никой не иска да е слаб колкото “Виктор Бечев” - име свързано с криминални престъпления по целия свят и обявен за международно 
издирване или да дава гадни домашни с още по-невъзможни тестове, в които слага снимки, на които иронично бърка цимент, за 
да ни се подиграва на пътя, който ще изберем след тази избираема дисциплина - “Георги Кунчев”. Чу ли, Жорка, r"^gadni\b" домашни.

Всички тези житейски проблеми, обгърнали битието на студентите, следващи във ФМИ, са решени благодарение на 
Shredded Monty Python (не знам как ги решава). Това е уеб приложение, идеята зад което е да помогне на хората 
да постигнат своите фитнес цели, като предостави удобен и ефективен начин за проследяване на тренировките и 
физическия прогрес. Чрез лесен за използване интерфейс потребителите могат да записват своите тренировки, 
да следят промените в теглото и телесните си измервания и да следят своето развитие. Всеки потребител ще може 
да сподели прогреса си с останалите потребители, което подсказва една от основните цели на платформата - 
да създаде целеустремена, взаимноподкрепяща се общност.

**[Functionalities/Надарености]**
1. **Потребителски профил**:
   
    Регистрация - потребителят трябва да се регистрира преди използването на функционалностите на платформата.
    Форма за регистрация:
        - Потребителите трябва да попълнят форма с основна информация минимални изисквания за сигурност като:
          - име и фамилия
          - имейл адрес - трябва да се валидира дали имейлът вече е използван
          - парола
   
    Вход - потребителят трябва да влезе в профила си, ако вече се е регистрирал.
    Форма за вход:
        - имейл адрес
        - парола
   
    Личен профил с информация за тренировки и тегло:
        - Приложението дава възможност на потребителите да създадат собствени рутинни програми, които са изградени според 
          различни фитнес цели – загуба на тегло, изграждане на мускулна маса, подобряване на издръжливостта и други.

2. **Администраторски профил**:
    - Администраторът трябва да има достъп до всички функционалности, до които обикновения потребител има достъп.
    - Администраторът трябва да може да сменя пароли на обикновените потребители, техните имейли и дори да ги изтрива 
      напълно.
    - Администраторът трябва да може да трие постове, с цел да се запази адекватно ниво на цензура.
    - Администраторът трябва да може да изпраща имейл лично (негенериран) до даден потребител, ако това е необходимо.
    - Администраторът трябва да може да добавя нови упражнения в pool-a и да редактира предишните
    - Администраторът е готин.

3. **Тренировки**:
    - Възможност за добавяне на нова тренировка с полета:
    
        - Логнатият потребител трябва да може да създаде своя тренировка, като попълни необходимата форма за 
          създаване на такава.
        
        Формата ще съдържа:
            - Вид на тренировката (например кардио, силова тренировка, йога).
            - Продължителност в минути.
            - Дата на провеждане.
    
    - Преглед на всички записани тренировки в табличен формат:
        - Логнатият потребител трябва да може да види всички свои записани тренировки в табличен формат.
    - Редактиране и изтриване на записани тренировки:
        - Логнатият потребител трябва да може да редактира и изтрива своите записани тренировки.

4. **Проследяване на тегло**:
    - Добавяне на запис за тегло с дата на измерване:
        - Логнатият потребител трябва да може да добавя запис за теглото си в даден ден, като може да го запише в 
          килограми или паундове.
    - Преглед на всички записи в таблица:
        - Логнатият потребител трябва да може да види всички свои записани измервания в табличен формат.
    - Генериране на графика за промяната на теглото с времето:
        - Логнатият потребител трябва да може да види графика, илюстрираща теглото му във времето.

5. **Графики и визуализации**:
    - Графика за напредъка на теглото (тегло спрямо време).
    - Визуализация на напредъка на потребителя спрямо сила.

6. **Известия**:
    - Известия за успешно добавяне, редактиране или изтриване на данни чрез Django messages.
    - Приложението предлага статистики по имейл (текущ месец/предходен месец), които дават визуална представа за 
      постигнатия напредък.
    - Push Notifications - с цитати на готини хора, напр.: “Аз няма да пия” ~Костадин Русалов.

7. **For You**
    
    - интерактивно пространство в приложението, където потребителите могат да се свързват, да споделят своя опит и да 
    участват в активни дискусии, свързани с техните фитнес цели и постижения.
    
    Какво предоставя For You:
        - Публикуване на постове:
            - Потребителите могат да създават свои постове, в които да споделят мотивационни истории, съвети за тренировки, 
              въпроси или просто вдъхновяващи моменти от личното си фитнес пътуване (текст, снимки, клипове).
        - Харесване и коментиране:
            - Всяка публикация може да бъде харесвана от други потребители, като по този начин се създава чувство на подкрепа 
              и мотивация в общността.
        - Водене на дискусии:
            - For You е място за открити и вдъхновяващи дискусии.
            
8. **Разновидност от калкулатори** 

    - страница от платформата, в която потребителят ще може да се възползва от набор от калкулатори,
    с помощта на които може да получи нужна за него информация
    
        - 1. One-Rep Max (1RM) Калкулатор - позволява на потребителите да изчислят максималната тежест, която могат да повдигнат
    за едно повторение, базирано на текущата им тежест и брой повторения.
        - 2. BMI (Body Mass Index) Калкулатор - калкулатор за телесна маса, който определя дали потребителят е поднормено тегло, нормално тегло, 
    наднормено тегло или със затлъстяване
        - 3. Калориен Калкулатор - позволява да се определят колко калории са необходими за поддържане на текущото тегло, базирано на активността.
        - 4. Калкулатор за мазнини в тялото (Body Fat Percentage) - изчислява процента телесни мазнини, базирано на обиколки на тялото.        

9. **Страница с упражнения**
    
    - Shredded Monty Python ще включва страница с различни упражнения, която позволява на потребителите да разглеждат и организира
    тренировките си по удобен и интуитивен начин.

    Функционалности на страницата с упражнения:
        1. Тагове за упражнения:
            - видове тагове:
                > мускулни групи: "back", "chest", "legs", "arms", "core".
                > ниво на трудност: "beginner", "intermediate", "advanced".
                > оборудване: "barbell", "dumbbells", "bodyweight", "resistance bands".
                > тип на упражнението: "strength", "crossfit" (тагът ще бъде баннат предварително), "cardio", "functional training".

            - всяко упражнение ще бъде категоризирано с един или повече тагове:
            - тагове ще позволяват лесно търсене и филтриране.
        
        2. Сортиране:
            - азбучен ред (A-Z или Z-A).
            - ниво на трудност: "beginner", "intermediate", "advanced".

        3. Филтриране
            - потребителите ще могат да филтрират упражненията чрез таговете, което ще улесни намирането на подходящи упражнения за техните нужди.
        
        4. Формите на упражненията освен тагове и име на упражнението, ще включват и YouTube линкове към съответното упражнение, за да може да се визуализира
        лесно начина му на изпълнение на потребителя

10. (ако все още имам проблеми с визуализация > логика)
        
    Карта с фитнеси в близост до потребителя:
        - платформата ще поддържа карта, която използва текущото местоположение на потребителя и поддържа.
            > автоматично намиране на фитнеси в радиус от 5км
            > маркери за всеки фитнес с информация като име, адрес и рейтинг.
        
    Преглед на рецензии:
        - всяко място ще има секция за рецензии, където потребителите могат:
            > да виждат съществуващи рецензии (ако се използва Google Places, рецензиите ще бъдат интегрирани директно).
            > да добавят свои рецензии за съответния фитнес.

    Добавяне на рецензии:
        - регистрираните (логнатите) потребители могат да добавят своя оценка (от 1 до 5 звезди) и кратка похвала/критика.
        
    Система за рейтинг:
        - автоматично изчисляване на средния рейтинг за всеки фитнес въз основа на рецензиите от потребителите.
        - сравнение на рейтингите на различните фитнеси.

    Филтри и търсене:
        - потребителите могат да търсят фитнеси на картата по критерии като:
            > рейтинг.
            > разстояние от текущото местоположение.
        
**[Milestones/Възлови точки]**
    - Инициализация на проекта:
        - Създаване на нов Django проект и приложение.
        - Конфигуриране на PostgreSQL база данни чрез psycopg2.
        - Настройка на Django Admin за управление на данните.
    - Създаване на модели:
        - Модел за потребители: Използване на вградения User модел в Django.
        - Модел за тренировки: Полета: вид тренировка, продължителност, дата, потребител.
        - Модел за тегло: Полета: дата на измерване, тегло, потребител.
        - Модел за упражнения: Полета: име, тагове (мускулни групи, ниво на трудност, оборудване, тип), YouTube линк.
        - Модел за публикации и коментари в For You.
    - CRUD функционалности за тренировки и тегло:
        - Създаване на изгледи за добавяне, редактиране и изтриване на записи.
        - Форми за валидиране на входните данни.
        - Списък с всички записи за тренировки и тегло.
    - Автентикация и ограничение на достъпа:
        - Регистрация, вход и изход за потребители с валидиране на данни.
        - Ограничаване на достъпа до функционалностите за логнати потребители.
    - Frontend и визуализация:
        - Създаване на шаблони с Django templates.
        - Интеграция на Bootstrap за създаване на удобен интерфейс.
        - Добавяне на графики за прогреса на теглото с Chart.js или Matplotlib.
    - For You функционалности:
        - Реализиране на функционалности за публикуване на постове, коментиране и харесване.
        - Визуализация на списък с постове.
        - Поддръжка на качване на медийни файлове.
    - Известия и push нотификации:
        - Реализация на push известия и известия чрез имейл, включително използване на Django messages.
    - Разновидност от калкулатори:
        - изграждане на калкулатори:
            > One-Rep Max (1RM) Калкулатор.
            > BMI (Body Mass Index) Калкулатор.
            > Калориен Калкулатор.
            > Калкулатор за мазнини в тялото (Body Fat Percentage).
    - Страница с упражнения:
            > Разработка на страница за разглеждане и организиране на упражнения.
            > Добавяне на тагове за упражнения: мускулни групи, ниво на трудност, тип оборудване, видове упражнения.
            > Реализиране на функционалност за търсене, сортиране (A-Z или Z-A) и филтриране чрез тагове.
    -  Карта
            > Маркиране на фитнеси в радиус
            > Рецензии
            > Рейтинг система
    
**[Estimate in man-hours/Времеоценка в човекочасове]**
    - Инициализация на проекта (10 - 15 човекочаса).
    - Създаване на модели (10 - 15 човекочаса).
    - CRUD функционалности за тренировки и тегло (15- 20 човекочаса).
    - Автентикация и ограничение на достъпа (10 - 15 човекочаса).
    - Frontend и визуализация (15 - 20 човекочаса).
    - For You функционалности (20 - 25 човекочаса).
    - Известия и push нотификации (10 - 15 човекочаса).
    - Разновидност от калкулатори (5 - 10 човекочаса).
    - Страница с упражнения (15 - 20 човекочаса).
    - Карта (25 - 30 човекочаса) (или 500 години). 
    - Тестване и завършване (15 - 20 човекочаса).

Общо време 125(150) - 175(205) човекочаса

**[Usage of technologies/Потребление на технологии]**
    - **Backend**: Django (създаване на RESTful API за функционалностите).
    - **База данни**: PostgreSQL.
    - **Frontend**:
        - Django templates (генериране на HTML съдържание).
        - Bootstrap (стилизация на интерфейса).
        - Chart.js или Matplotlib (визуализация на данни).
    - **Библиотеки**:
        - `psycopg2` (връзка между Django и PostgreSQL).
        - Django messages (съобщения за успех/грешка).
    - **Карта**:
        - Google Maps API
        - Google Places API
"""